<a href="https://colab.research.google.com/github/prateekhcu/AAIC-Python-Assignment/blob/master/pandas_basics_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [109]:
import pandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

data['labels'] = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data)
df.set_index('labels')

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no




**2. Display a summary of the basic information about birds DataFrame and its data.**

In [110]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000


**3. Print the first 2 rows of the birds dataframe**

In [111]:
df.head(2)

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [112]:
dataframe = pd.DataFrame(data, columns=['birds','age','labels'])
dataframe.set_index('labels')

             birds  age
labels
a           Cranes  3.5
b           Cranes  4.0
c          plovers  1.5
d       spoonbills  NaN
e       spoonbills  6.0
f           Cranes  3.0
g          plovers  5.5
h           Cranes  NaN
i       spoonbills  8.0
j       spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [113]:
print(df['birds'].iloc[2],df['age'].iloc[2],df['visits'].iloc[2])
print(df['birds'].iloc[3],df['age'].iloc[3],df['visits'].iloc[3])
print(df['birds'].iloc[7],df['age'].iloc[7],df['visits'].iloc[7])

plovers 1.5 3
spoonbills nan 4
Cranes nan 2

**6. select the rows where the number of visits is less than 4**

In [114]:
df[df['visits']<4]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [115]:
df[df['age'].isnull()]

        birds  age  visits priority labels
3  spoonbills  NaN       4      yes      d
7      Cranes  NaN       2      yes      h

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [116]:
df[(df['birds']== 'Cranes') & (df['age']<4)]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
5  Cranes  3.0       4       no      f

**9. Select the rows the age is between 2 and 4(inclusive)**

In [117]:
df[(df['age']>2) & (df['age']<4)]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
5  Cranes  3.0       4       no      f

**10. Find the total number of visits of the bird Cranes**

In [118]:
df[(df['birds'] == 'Cranes') & (df['visits']>0)].sum()

birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                 yesyesnoyes
labels                          abfh
dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [119]:
df['age'].mean()

4.4375

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [120]:
#s = df.xs(8)
newdf = pd.DataFrame({"birds":['Cranes'],"age":[4],"visits":[2],"priority":['yes'],"labels":['a']})
df.append(newdf, ignore_index=True)
df.drop([df.index[9]])

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i

**13. Find the number of each type of birds in dataframe (Counts)**

In [121]:
df.groupby([df['birds']]).count()

            age  visits  priority  labels
birds
Cranes        3       4         4       4
plovers       2       2         2       2
spoonbills    3       4         4       4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [122]:
sort_by_age = df.sort_values('age',ascending = False)
print(sort_by_age.head())
print("---------------")
sort_by_value = df.sort_values('visits', ascending = True)
print(sort_by_value.head())

        birds  age  visits priority labels
8  spoonbills  8.0       3       no      i
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
1      Cranes  4.0       4      yes      b
9  spoonbills  4.0       2       no      j
---------------
        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
9  spoonbills  4.0       2       no      j
2     plovers  1.5       3       no      c

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [124]:
df.priority.map(dict(no=0,yes=1))

0    1
1    1
2    0
3    1
4    0
5    0
6    0
7    1
8    0
9    0
Name: priority, dtype: int64

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [130]:
df.birds.map(lambda x: 'trumpeters' if x=='Cranes' else x)

0    trumpeters
1    trumpeters
2       plovers
3    spoonbills
4    spoonbills
5    trumpeters
6       plovers
7    trumpeters
8    spoonbills
9    spoonbills
Name: birds, dtype: object